app/helpers/sessions_helper.rb

SELECT "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "Antonio"], ["LIMIT", 1]]
---
  def current_user
    return unless session[:name]

    @current_user ||= User.find_by(name: session[:name])