app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "Antonio"], ["LIMIT", 1]]
---
  def current_user
    if (name = session[:name])
      @current_user ||= User.find_by(name: name)